Artillery/create-auctions.yml
config:
  target: 'https://scc-backend-58001-52949-57797.azurewebsites.net/rest'
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true  # new mode to aggregate metrics in artillery
  processor: "./test-utils.js"
  variables:
    numAuctions : 300
    maxBids : 3  # maximum number of bids to generate for each new auction
    maxQuestions : 10 # maximum number of questions to generate for each new auction
  phases:
  - name: "Create auctions"    # Create channels
    duration: 1
    arrivalCount: 1

scenarios:
  - name: 'Create auctions'
    weight: 1
    flow:
      - loop:                            # let's create numAuctions auctions - loop ... count
        - function: "selectUserSkewed"
        - post:                          # First: login as a user
            url: "/user/auth"
            name: "POST:/user/auth"
            headers:
              Content-Type: application/json
            json:
              nickname: "{{ user }}"
              pwd: "{{ pwd }}"
        - function: "genNewAuction"
        - post:                          # First: post image for the auction
            url: "/media"
            name: "POST:/media"
            headers:
              Content-Type: application/octet-stream
              Accept: text/plain
            beforeRequest: "uploadImageBody"
            capture: 
              regexp: "(.+)"
              as: "imageId"              # capture the reply as image id to be used in uction creation
        - post:                          # Create auction
            url: "/auction"
            name: "POST:/auction"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              description: "{{ description }}"
              title: "{{ title }}"
              owner_nickname: "{{ user }}"
              image_id: "{{ imageId }}"
              end_time: "{{ endTime }}"
              min_price: "{{ minimumPrice }}"
              closed: "{{ status }}"
            afterResponse: "captureAuction"
        - loop:                          # Let's add numBids bids to the auction
          - function: "selectUserSkewed"
          - function: "genNewBid"
          - post:                         
              url: "/user/auth"
              name: "POST:/user/auth"
              headers:
                Content-Type: application/json
              json:
                nickname: "{{ user }}"
                pwd: "{{ pwd }}"
          - post:                          # New bid     
              url: "/auction/{{ auctionId }}/bid"
              name: "POST:/auction/*/bid"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                bidder: "{{ user }}"
                amount: "{{ value }}"
          count: "{{ numBids }}"   
        - loop:                          # Let's add numQuestions questions to the auction
          - function: "selectUserSkewed"
          - function: "genNewQuestion"
          - post:                         
              url: "/user/auth"
              name: "POST:/user/auth"
              headers:
                Content-Type: application/json
              json:
                nickname: "{{ user }}"
                pwd: "{{ pwd }}"
          - post:                          # New question     
              url: "/auction/{{ auctionId }}/question"
              name: "POST:/auction/*/question"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                questioner: "{{ user }}"
                text: "{{ text }}"
          count: "{{ numQuestions }}"   
        count: "{{ numAuctions }}"